# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

In [3]:
s1.head()

0    3
1    3
2    4
3    2
4    4
dtype: int64

In [4]:
s2.head()

0    1
1    2
2    2
3    1
4    1
dtype: int64

In [5]:
s3.head()

0    21579
1    19918
2    24348
3    14920
4    21161
dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt

    0  1      2
0   3  1  21579
1   3  2  19918
2   4  2  24348
3   2  1  14920
4   4  1  21161
.. .. ..    ...
95  4  1  24019
96  2  3  15366
97  1  3  21452
98  2  3  29987
99  1  3  17316

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
housemkt.rename(columns = {0 : 'bedrs', 1 : 'bathrs', 2 : 'price_sqr_meter'}, inplace = True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            21579
1      3       2            19918
2      4       2            24348
3      2       1            14920
4      4       1            21161

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [12]:
bigcolumn = pd.concat([s1, s2, s3], axis = 0)
bigcolumn.shape

(300,)

In [19]:
bigcolumn

        0
0       3
1       3
2       4
3       2
4       4
..    ...
95  24019
96  15366
97  21452
98  29987
99  17316

[300 rows x 1 columns]

In [13]:
bigcolumn = pd.DataFrame(bigcolumn)
type(bigcolumn)

pandas.core.frame.DataFrame

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [14]:
len(bigcolumn)

300

In [15]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [20]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        3
2        4
3        2
4        4
..     ...
295  24019
296  15366
297  21452
298  29987
299  17316

[300 rows x 1 columns]